export const mockCalculations = [
  {
    name: "001",
    ДатаПросчета: "2025-09-30",
    КоличествоКонструкцийВПросчете: 5,
    items: [
      {
        name: "A001",
        ДатаЗаказа: "2025-09-25",
        КоличествоКонструкцийВЗаказе: 3,
        СуммаЗаказа: 15000,
        ОплаченоПоЗаказу: 5000,
        ЭтапВыполненияЗаказа: "Новий",
        СостояниеЗаказа: "Не підтверджено",
        ФактическаяДатаПроизводстваМакс: null,
        ПлановаяДатаПроизводстваМакс: "2025-10-05",
        ФактическаяДатаГотовностиМакс: null,
        ДатаРеализации: null
      },
      {
        name: "A002",
        ДатаЗаказа: "2025-09-26",
        КоличествоКонструкцийВЗаказе: 2,
        СуммаЗаказа: 8000,
        ОплаченоПоЗаказу: 8000,
        ЭтапВыполненияЗаказа: "В обробці",
        СостояниеЗаказа: "Подтверждено",
        ФактическаяДатаПроизводстваМакс: "2025-09-28",
        ПлановаяДатаПроизводстваМакс: "2025-09-27",
        ФактическаяДатаГотовностиМакс: null,
        ДатаРеализации: null
      }
    ]
  },
  {
    name: "002",
    ДатаПросчета: "2025-09-28",
    КоличествоКонструкцийВПросчете: 3,
    items: [
      {
        name: "B001",
        ДатаЗаказа: "2025-09-27",
        КоличествоКонструкцийВЗаказе: 1,
        СуммаЗаказа: 5000,
        ОплаченоПоЗаказу: 5000,
        ЭтапВыполненияЗаказа: "Готовий",
        СостояниеЗаказа: "Подтверждено",
        ФактическаяДатаПроизводстваМакс: "2025-09-28",
        ПлановаяДатаПроизводстваМакс: "2025-09-27",
        ФактическаяДатаГотовностиМакс: "2025-09-29",
        ДатаРеализации: null
      }
    ]
  },
  {
    name: "00667563",
    ДатаПросчета: "2025-09-27",
    КоличествоКонструкцийВПросчете: 4,
    items: [
      {
        name: "C001",
        ДатаЗаказа: "2025-09-27",
        КоличествоКонструкцийВЗаказе: 4,
        СуммаЗаказа: 20000,
        ОплаченоПоЗаказу: 0,
        ЭтапВыполненияЗаказа: "Відмова",
        СостояниеЗаказа: "Не підтверджено",
        ФактическаяДатаПроизводстваМакс: null,
        ПлановаяДатаПроизводстваМакс: "2025-10-01",
        ФактическаяДатаГотовностиМакс: null,
        ДатаРеализации: null
      }
    ]
  }, {
    name: "04203",
    ДатаПросчета: "2025-09-27",
    КоличествоКонструкцийВПросчете: 4,
    items: [
      {
        name: "C001",
        ДатаЗаказа: "2025-09-27",
        КоличествоКонструкцийВЗаказе: 4,
        СуммаЗаказа: 20000,
        ОплаченоПоЗаказу: 0,
        ЭтапВыполненияЗаказа: "Відмова",
        СостояниеЗаказа: "Не підтверджено",
        ФактическаяДатаПроизводстваМакс: null,
        ПлановаяДатаПроизводстваМакс: "2025-10-01",
        ФактическаяДатаГотовностиМакс: null,
        ДатаРеализации: null
      }
    ]
  }, {
    name: "2003",
    ДатаПросчета: "2025-09-27",
    КоличествоКонструкцийВПросчете: 4,
    items: [
      {
        name: "C001",
        ДатаЗаказа: "2025-09-27",
        КоличествоКонструкцийВЗаказе: 4,
        СуммаЗаказа: 20000,
        ОплаченоПоЗаказу: 0,
        ЭтапВыполненияЗаказа: "Відмова",
        СостояниеЗаказа: "Не підтверджено",
        ФактическаяДатаПроизводстваМакс: null,
        ПлановаяДатаПроизводстваМакс: "2025-10-01",
        ФактическаяДатаГотовностиМакс: null,
        ДатаРеализации: null
      }
    ]
  }, {
    name: "0203",
    ДатаПросчета: "2025-09-27",
    КоличествоКонструкцийВПросчете: 4,
    items: [
      {
        name: "C05401",
        ДатаЗаказа: "2025-09-27",
        КоличествоКонструкцийВЗаказе: 4,
        СуммаЗаказа: 20000,
        ОплаченоПоЗаказу: 0,
        ЭтапВыполненияЗаказа: "Відмова",
        СостояниеЗаказа: "Не підтверджено",
        ФактическаяДатаПроизводстваМакс: null,
        ПлановаяДатаПроизводстваМакс: "2025-10-01",
        ФактическаяДатаГотовностиМакс: null,
        ДатаРеализации: null
      }
    ]
  }, {
    name: "0053",
    ДатаПросчета: "2025-09-27",
    КоличествоКонструкцийВПросчете: 4,
    items: [
      {
        name: "C001",
        ДатаЗаказа: "2025-09-27",
        КоличествоКонструкцийВЗаказе: 4,
        СуммаЗаказа: 20000,
        ОплаченоПоЗаказу: 0,
        ЭтапВыполненияЗаказа: "Відмова",
        СостояниеЗаказа: "Не підтверджено",
        ФактическаяДатаПроизводстваМакс: null,
        ПлановаяДатаПроизводстваМакс: "2025-10-01",
        ФактическаяДатаГотовностиМакс: null,
        ДатаРеализации: null
      }
    ]
  }, {
    name: "04503",
    ДатаПросчета: "2025-09-27",
    КоличествоКонструкцийВПросчете: 4,
    items: [
      {
        name: "C001",
        ДатаЗаказа: "2025-09-27",
        КоличествоКонструкцийВЗаказе: 4,
        СуммаЗаказа: 20000,
        ОплаченоПоЗаказу: 0,
        ЭтапВыполненияЗаказа: "Відмова",
        СостояниеЗаказа: "Не підтверджено",
        ФактическаяДатаПроизводстваМакс: null,
        ПлановаяДатаПроизводстваМакс: "2025-10-01",
        ФактическаяДатаГотовностиМакс: null,
        ДатаРеализации: null
      }
    ]
  },
  
];
